content/resume.md
+++
title = "Software Engineer"
draft = false
author = "Xiong ChenYu"
+++

<ul id="cvcontacts">
<li class="fa fa-envelope"><a href="mailto:xiongchenyu6@gmail.com"> xiongchenyu6@gmail.com</a></li>
<li class="fa fa-globe"><a href="https://xiongchenyu6.github.io"> xiongchenyu6.github.io</a></li>
<li class="fab fa-github"><a href="https://www.github.com/xiongchenyu6"> xiongchenyu6</a></li>
<li class="fab fa-linkedin"><a href="https://www.linkedin.com/in/chenyu-xiong"> chenyu-xiong</a></li>
</ul>

## Employment {#employment}


### Software Engineer

<ul class="cventry">
    <li class="fa fa-building"> Bigo</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Feb 2019 -- Apr 2020</li>
</ul>

-   Develop online recommendation infrastructure and performance optimization tricks use C++.
-   Design and implement the base nearline infrastructure user event tracking aggregation system use Flink for multiple product lines.
-   Design and Build an internal streaming process framework extension focus on Id, Session Features and Forward Index based on Flink wrote in scala use shapeless for generics and scala macro for performance.
-   Establish monitor system for recommendation system use prometheus promgen

filebeat elasticsearch kibana grafana


### Full stack Engineer

<ul class="cventry">
    <li class="fa fa-building"> Bitmain</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Sep 2018 -- Jan 2019</li>
</ul>

-   Develop miniapp management system for Chatchat backend and frontend
-   Develop Memo (twitter on blockchain) backend use graphql and neo4j
-   Develop a bchsv separation miniapp to split bchabc and bchsv
-   Develop Devops stack use nixops and hydra for my projects


### Software Engineer

<ul class="cventry">
    <li class="fa fa-building"> LeadIQ</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Feb 2018 -- Aug 2018</li>
</ul>

-   Build reward system frontend and backend for users who contribute the data.
-   Use blockchain as the database with versioning and audit history.
-   Build a hyperledger based service to share data with partners.
-   Data parsing, web scraping and Cluster Data processing use spark.
-   Enrich the voter information for bidding to split California into 3 states.


## Education {#education}


### Bachelor of Engineer

<ul class="cventry">
    <li class="fa fa-building"> Nanyang Technological University</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Aug 2015 -- Jun 2018</li>
</ul>

Major in Electrical and Electronic Engineer Specialization in Info-communication


### Nanyang Polytechnic

<ul class="cventry">
    <li class="fa fa-building"> Nanyang Polytechnic</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Apr 2013 -- Jun 2015</li>
</ul>

Major in Electronic Computer & Communication Engineering Specialization in Embedded-System


## School Projects {#school-projects}


### Final year project

<ul class="cventry">
    <li class="fa fa-building"> Nanyang Technological University</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Aug 2017 -- Jun 2018</li>
</ul>

Homepage: <https://github.com/xiongchenyu6/Final-Year-Project>
Officail WebSite: <http://www.xiaopodao.com/>

-   Develop a web-based management system for international delivery sharing and market analysis enhanced with machine learning
-   Build a web management system to fit fight group to deliver, track, and notify the receiver.
-   Use data collected above to analyzing the marketing with the modern data mining and ai technology.
-   1000+ Register Users in NTU
-   30000+ Packages send to Singapore


### Design & Innovation Project (DIP)

<ul class="cventry">
    <li class="fa fa-building"> Nanyang Technological University</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Jan 2016 -- May 2016</li>
</ul>

homepage: <https://github.com/xiongchenyu6/dip%5Fproject%5Ffor%5Fobd>

-   head up display projection for car
-   use raspberry pi to collect the data from obd by python.
-   use nodejs to build a light weight server.and process the obd info with google direction.
-   create the website to display the data.
-   win the best demo


### Final year project

<ul class="cventry">
    <li class="fa fa-building"> Nanyang Polytechnic</li>
    <li class="fa fa-map-marker"> Singapore</li>
    <li class="fa fa-calendar"> Jun 2014 -- Aug 2014</li>
</ul>

Homepage: <https://github.com/xiongchenyu6/NYP-FPY>

-   Smart House Sharing
-   Use Arduino to control the house model and collect sensors data
-   Design and build a Android app for user to login and authorization
-   Use NFC to unlock the house door


## Programming Skills {#programming-skills}

| Type                   | Lang                                            |
|------------------------|-------------------------------------------------|
| Declarative            | Html5(pug) Css(less,sass)                       |
| Procedure              | C C++ Python(Django) Nodejs(Express Meteor)     |
| Functional             | Haskell Scala(Scalaz, Shapeless) Elisp          |
| Object-oriented        | Java(Play, Android) C#(Asp.net)                 |
| Js Sub-Languages       | Js(Es6) Typescript Coffeescript ScalaJs         |
| Concurrent Programming | Scala(Akka) Haskell(stm) clojure(Channel)       |
| Front-end framework    | Reflex Halogen Anguler React Ramda              |
| Front-end Style        | Bootstrap 3&4 Materil UI Antd                   |
| Front-end Module       | Webpack Parcel Jest                             |
| Full-stack framework   | Ionic3 React Native Electron                    |
| System                 | Nixos Linux(zshell tmux vim emacs) Docker Mac   |
| IOT                    | Raspberry Pi Arduino DSP                        |
| Database               | Mysql Mongodb Firebase Hyperledger Fabric       |
| Documentation          | Latex Markdown Gitbook Org Mode                 |
| Devops                 | Aws Nix Nixos Nixops hydra k8s docker           |
| Testing                | CI/CD + Spec + Property Test                    |
| Big Data               | Flink Spark Hadoop Yarn Kafka AirFlow           |
| Rpc                    | brpc grpc                                       |
| Monitor                | promethues filebeat logstash kibana open falcon |
